limit = [
    [3, 6500],    # 0.3MPa凝结水出装置流量
    [0, 300],     # 预热器出口空气温度
    [0, 400],     # 对流室出口温度
    [0, 200],     # 壳程出口温度
    [0, 380],     # E-101ABC管程出口温度
    [5, 400],     # E-101DEF管程出口温度
    [5, 150],     # E-101壳程出口总管温度
    [-1, 150],    # E-101DEF壳程出口温度
    [40, 800],    # 塔顶回流罐D201液位
    [25, 110],    # 1.1步骤PIC2401B.OP
    [0, 140],     # 1#催化汽油进装置流量
    [400, 450],   # R-101床层中部温度
    [2.95, 7.00],  # 反应器质量空速
    [15, 45],     # 反应器藏量
    [15, 45],     # 由PDI2104计算出
    [50, 110],    # 反应器顶底压差
    [200, 350],   # 还原器温度
    [0, 350],     # D105流化氢气流量
    [-14000, 3500],    # 8.0MPa氢气至反吹氢压缩机出口
]

delta = [50.0, 2.0, 2.0, 2.0, 2.0, 1.0, 1.0, 1.0, 50.0, 10.0, 5.0, 1.0, 0.5, 1.0, 1.0, 5.0, 1.0, 50.0, 1000.0]
